Reports/СравнительныйАнализ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Report>
		<Properties>
			<Name>СравнительныйАнализ</Name>
			<Comment>vvv</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормативЗарплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеГруппироватьПоМастерам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтветственныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ТарифныеСтавкиРаботниковОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ТарифныеСтавкиРаботниковОрганизации</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентПоКонтракту</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСПовышениемПоИнструкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаЗавершения</Name>
					<Comment>(Общ) vvv</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентПоКонтрактуЗавершения</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаЗавершения</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСПовышениемПоИнструкцииЗавершения</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РабочееВремяРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<AccumulationRegister>
		<Properties>
			<Name>РабочееВремяРаботниковОрганизаций</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Часов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейПоНорме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧасовПоНорме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СводнаяЗапись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВЦеломЗаПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидИспользованияРабочегоВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СведенияОВидахРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>СведенияОВидахРабот</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтоимостьПоПрейскуранту</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КолЧеловек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаработнаяПлатаОсновная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаработнаяПлатаДополнительная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормативЗарплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасчетСдельныхРасценок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыЗанятостиВОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыЗанятостиВОрганизации</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновноеМестоРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Совместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСовместительство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыПриемаДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВариантыПриемаДенежныхСредств</Name>
			<Comment>vvv</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоследующаяОплатаПоСчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Карточка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоплатаЧерезБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезвозмезднаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АкционнаяУслуга</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/СравнительныйАнализ/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция УточнитьЧасыПоМастерам(Знач ТаблицаВремени, Знач Сотрудник,Знач Мастер,Знач Часов) 
	
	ВозврЧасов = Часов;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Сотрудник",Сотрудник);
	
	СтрокиПоСотруднику = ТаблицаВремени.НайтиСтроки(СтруктураПоиска);
	
	БылоРаспределение = Ложь;
	
	Если СтрокиПоСотруднику.Количество()>0 Тогда
		
		Для к = 0 По СтрокиПоСотруднику.Количество()-1 Цикл
			
			ОбрабатываемаяДата = СтрокиПоСотруднику[к].ДатаВыполнения;	
			СтруктураПоиска.Вставить("ДатаВыполнения",ОбрабатываемаяДата);
			НайденныеДаты = ТаблицаВремени.НайтиСтроки(СтруктураПоиска); 
			
			Если НайденныеДаты.Количество()>1 Тогда //надо распределить
				
				БылоРаспределение = Истина;
				
				МассивКоэффициентов = Новый Массив(НайденныеДаты.Количество());				
				
				Для н=0 по НайденныеДаты.Количество()-1 Цикл
					МассивКоэффициентов[н] = (НайденныеДаты[н].ПродолжительностьРаботы);	
				КонецЦикла;
				
				МассивРаспределения = ОбщегоНазначения.РаспределитьПропорционально(НайденныеДаты[0].Часов,МассивКоэффициентов);
				
				Для н=0 по НайденныеДаты.Количество()-1 Цикл
					НайденныеДаты[н].ОтработаноЧасов = МассивРаспределения[н];	
				КонецЦикла;
				
			Иначе //оставляем как есть
				НайденныеДаты[0].ОтработаноЧасов = 	НайденныеДаты[0].Часов;
			КонецЕсли;			
			
		КонецЦикла;
				
	КонецЕсли;	
	
	Если Не БылоРаспределение Тогда		
		
		Возврат ВозврЧасов;
		
	Иначе
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Сотрудник",Сотрудник);
		СтруктураПоиска.Вставить("Мастер",Мастер);
		
		НайденныеСтроки = ТаблицаВремени.НайтиСтроки(СтруктураПоиска);
		
		ОтработаноЧасов = 0;
		
		Для к=0 По НайденныеСтроки.Количество()-1 Цикл
			
			ОтработаноЧасов = ОтработаноЧасов + НайденныеСтроки[к].ОтработаноЧасов;	
			
		КонецЦикла;		
		
		
		Возврат ОтработаноЧасов;
		
	КонецЕсли;
	
	
КонецФункции

Процедура СформироватьОтчет(ДокументРезультат, ЕстьОшибки = Ложь) Экспорт
    ДокументРезультат.Очистить();
	
	//Параметры документа
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.ПолеСлева			 = 10;
	ДокументРезультат.ПолеСправа		 = 0;
	ДокументРезультат.Защита             = Ложь;
	ДокументРезультат.ТолькоПросмотр     = Истина;
    ДокументРезультат.АвтоМасштаб		 = Истина;
	
	РеглВалюта = Константы.ВалютаРегламентированногоУчета.Получить();
    СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация,КонПериода);
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(НачПериода));
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("НормативЗарплаты",НормативЗарплаты);
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(КонПериода));
	
	СписокСпособовПовременки = Новый СписокЗначений;
	СписокСпособовПовременки.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке);
	СписокСпособовПовременки.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавкеВодителей);
	
	СписокСпособовСделки = Новый СписокЗначений;
	СписокСпособовСделки.Добавить(Перечисления.СпособыРасчетаОплатыТруда.СделкаПоЧасовойТарифнойСтавке);
	СписокСпособовСделки.Добавить(Перечисления.СпособыРасчетаОплатыТруда.СделкаПоЧасовойТарифнойСтавкеВодителей);
	
	СписокЯвок = Новый СписокЗначений;
	СписокЯвок.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.Работа);
	СписокЯвок.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.Линия);
	СписокЯвок.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ЛинияСдельно);
	
	Запрос.УстановитьПараметр("СписокСпособовПовременки",СписокСпособовПовременки);
	Запрос.УстановитьПараметр("СписокСпособовСделки",СписокСпособовСделки);
	
	Запрос.УстановитьПараметр("СписокЯвок",СписокЯвок);
	
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
	|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета
	|ПОМЕСТИТЬ ВТСотрудники
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|ГДЕ
	|	ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &Началопериода И &КонецПериода
	|	И ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение = &Организация
	|	И ОсновныеНачисленияРаботниковОрганизаций.Результат <> 0
	|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени В (&СписокЯвок)";
	
	Если ТипСотрудника = 0 ТОгда
		Запрос.Текст = Запрос.Текст+
		"И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета В (&СписокСпособовСделки)
		|;";
	ИначеЕсли ТипСотрудника = 1 ТОгда
		Запрос.Текст = Запрос.Текст+
		"И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета В (&СписокСпособовПовременки)
		|;";
	Иначе
		Запрос.Текст = Запрос.Текст+
		";";
	КонецЕсли;
	
	Запрос.Текст =	Запрос.Текст+
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ТарифныеСтавкиРаботниковОрганизации.Период) КАК Период,
	|	ТарифныеСтавкиРаботниковОрганизации.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
	|			ТОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор.Организация
	|		КОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
	|				И ТарифныеСтавкиРаботниковОрганизации.Регистратор.ОбособленноеПодразделениеКуда = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор.Организация
	|		ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Регистратор.ОбособленноеПодразделениеКуда
	|	КОНЕЦ КАК Организация
	|ПОМЕСТИТЬ ВТДатыПоследнихИзмененийОкладов
	|ИЗ
	|	РегистрСведений.ТарифныеСтавкиРаботниковОрганизации КАК ТарифныеСтавкиРаботниковОрганизации
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
	|	ПО Сотрудники.Сотрудник = ТарифныеСтавкиРаботниковОрганизации.Сотрудник 	
	|ГДЕ
	|	ТарифныеСтавкиРаботниковОрганизации.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|	И ТарифныеСтавкиРаботниковОрганизации.Период <= &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ТарифныеСтавкиРаботниковОрганизации.Сотрудник,
	|	ВЫБОР
	|		КОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
	|			ТОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор.Организация
	|		КОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
	|				И ТарифныеСтавкиРаботниковОрганизации.Регистратор.ОбособленноеПодразделениеКуда = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор.Организация
	|		ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Регистратор.ОбособленноеПодразделениеКуда
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(РаботникиОрганизаций.Период) КАК Период,
	|	РаботникиОрганизаций.Сотрудник.Физлицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизаций.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РаботникиОрганизаций.ОбособленноеПодразделениеЗавершения
	|		ИНАЧЕ РаботникиОрганизаций.ОбособленноеПодразделение
	|	КОНЕЦ КАК Организация
	|ПОМЕСТИТЬ ВТДатыПоследнихДвижений
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
	|	ПО Сотрудники.Сотрудник = РаботникиОрганизаций.Сотрудник
	|ГДЕ
	|	РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|	И РаботникиОрганизаций.Период <= &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	РаботникиОрганизаций.Сотрудник.Физлицо,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизаций.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РаботникиОрганизаций.ОбособленноеПодразделениеЗавершения
	|		ИНАЧЕ РаботникиОрганизаций.ОбособленноеПодразделение
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатыПоследнихДвижений.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ДатыПоследнихДвижений.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ДатыПоследнихДвижений.Организация
	|		ИНАЧЕ ДатыПоследнихДвижений.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизацийСрезПоследних.ТабельныйНомер КАК ТабельныйНомер,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизацииЗавершения
	|		ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацийСрезПоследних.ДолжностьЗавершения
	|		ИНАЧЕ РаботникиОрганизацийСрезПоследних.Должность
	|	КОНЕЦ КАК Должность,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацийСрезПоследних.РазрядЕТСЗавершения
	|		ИНАЧЕ РаботникиОрганизацийСрезПоследних.РазрядЕТС
	|	КОНЕЦ КАК Разряд
	|ПОМЕСТИТЬ ВТДанныеСотрудника
	|ИЗ
	|	ВТДатыПоследнихДвижений КАК ДатыПоследнихДвижений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийСрезПоследних
	|		ПО ДатыПоследнихДвижений.Период = РаботникиОрганизацийСрезПоследних.Период
	|			И ДатыПоследнихДвижений.ФизЛицо = РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатыПоследнихИзмененийОкладов.Сотрудник КАК Сотрудник,
	|	ДатыПоследнихИзмененийОкладов.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТарифныеСтавкиРаботниковОрганизации.ПериодЗавершения <= &КонецПериода
	|				И ТарифныеСтавкиРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ТарифныеСтавкиРаботниковОрганизации.СтавкаЗавершения
	|		ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
	|	КОНЕЦ КАК Ставка
	|ПОМЕСТИТЬ ВТОклады
	|ИЗ
	|	ВТДатыПоследнихИзмененийОкладов КАК ДатыПоследнихИзмененийОкладов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавкиРаботниковОрганизации КАК ТарифныеСтавкиРаботниковОрганизации
	|		ПО ДатыПоследнихИзмененийОкладов.Сотрудник = ТарифныеСтавкиРаботниковОрганизации.Сотрудник
	|			И ДатыПоследнихИзмененийОкладов.Период = ТарифныеСтавкиРаботниковОрганизации.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РабочееВремяРаботниковОрганизаций.Сотрудник КАК Сотрудник,
	|	СУММА(РабочееВремяРаботниковОрганизаций.Часов) КАК Часов
	|ПОМЕСТИТЬ ВТРабочееВремяРаботниковОрганизаций
	|ИЗ
	|	РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
	|	ПО Сотрудники.Сотрудник = РабочееВремяРаботниковОрганизаций.Сотрудник
	|ГДЕ
	|	РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Работа)
	|	И РабочееВремяРаботниковОрганизаций.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочееВремяРаботниковОрганизаций.Сотрудник
	|;
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВыполнениеЗаданияРаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Мастер КАК Мастер,
	//
	|	СУММА(ВыполнениеЗаданияРаботникиОрганизации.ПродолжительностьРаботы) КАК ПродолжительностьРаботы,
	//
	|	НАЧАЛОПЕРИОДА(ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Дата,ДЕНЬ) КАК ДатаВыполнения
	|ПОМЕСТИТЬ ВТСотрудникиСДатами
	|ИЗ
	|	Документ.ВыполнениеЗадания.РаботникиОрганизации КАК ВыполнениеЗаданияРаботникиОрганизации
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
	|	ПО Сотрудники.Сотрудник = ВыполнениеЗаданияРаботникиОрганизации.Сотрудник
	|ГДЕ
	|	ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Организация=&Организация
	|	И ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Проведен
	//
	|СГРУППИРОВАТЬ ПО
	|	ВыполнениеЗаданияРаботникиОрганизации.Сотрудник,
	|	ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Мастер,
	|	НАЧАЛОПЕРИОДА(ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Дата,ДЕНЬ)
	//
	|;
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СотрудникиСДатами.Сотрудник КАК Сотрудник,
	|	СотрудникиСДатами.Мастер КАК Мастер,
	|	СУММА(РабочееВремяРаботниковОрганизаций.Часов) КАК Часов
	|ПОМЕСТИТЬ ВТРабочееВремяРаботниковОрганизацийПоМастерам
	|ИЗ
	|	ВТСотрудникиСДатами КАК СотрудникиСДатами
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
	|		ПО РабочееВремяРаботниковОрганизаций.Сотрудник = СотрудникиСДатами.Сотрудник
	|		И РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Работа)
	|		И НАЧАЛОПЕРИОДА(РабочееВремяРаботниковОрганизаций.Период,ДЕНЬ) = НАЧАЛОПЕРИОДА(СотрудникиСДатами.ДатаВыполнения)
	|		И РабочееВремяРаботниковОрганизаций.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|СГРУППИРОВАТЬ ПО
	|	СотрудникиСДатами.Сотрудник,
	|	СотрудникиСДатами.Мастер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВыполнениеЗаданияРаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Мастер КАК Мастер,
	|	СУММА(ВЫБОР
	|			КОГДА ВыполнениеЗаданияРаботникиОрганизации.ВариантПриемаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемаДенежныхСредств.БезвозмезднаяУслуга)
	//|				ТОГДА 0
	//по мнению гончаровой должна быть зарплата
	|				ТОГДА ВЫРАЗИТЬ(ВыполнениеЗаданияРаботникиОрганизации.Сумма * ВЫБОР КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.НормативЗарплаты, 0) = 0 ТОГДА &НормативЗарплаты ИНАЧЕ ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.НормативЗарплаты, 0) КОНЕЦ КАК ЧИСЛО(16, 2))
	|			КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) = 0
	|				ТОГДА ВЫРАЗИТЬ(СведенияОВидахРаботСрезПоследних.ЗаработнаяПлатаОсновная * ВыполнениеЗаданияРаботникиОрганизации.Количество КАК ЧИСЛО(16, 2))
	//|			ИНАЧЕ ВЫРАЗИТЬ(ВыполнениеЗаданияРаботникиОрганизации.Сумма * &НормативЗарплаты КАК ЧИСЛО(16, 2))
	|			ИНАЧЕ ВЫРАЗИТЬ(ВыполнениеЗаданияРаботникиОрганизации.Сумма * ВЫБОР КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.НормативЗарплаты, 0) = 0 ТОГДА &НормативЗарплаты ИНАЧЕ ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.НормативЗарплаты, 0) КОНЕЦ КАК ЧИСЛО(16, 2))
	|		КОНЕЦ) КАК СуммаПоНаряду,
	|	СУММА(ВЫБОР
	|			КОГДА ВыполнениеЗаданияРаботникиОрганизации.ВариантПриемаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемаДенежныхСредств.БезвозмезднаяУслуга)
	//|				ТОГДА 0
	|				ТОГДА ВыполнениеЗаданияРаботникиОрганизации.Сумма
	|			КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) = 0
	|				ТОГДА ВЫРАЗИТЬ(СведенияОВидахРаботСрезПоследних.ЗаработнаяПлатаОсновная * ВыполнениеЗаданияРаботникиОрганизации.Количество КАК ЧИСЛО(16, 3))
	|			ИНАЧЕ ВыполнениеЗаданияРаботникиОрганизации.Сумма
	|		КОНЕЦ) КАК ОбъемРабот,
	|	ВЫБОР
	|		КОГДА ВыполнениеЗаданияРаботникиОрганизации.ВариантПриемаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемаДенежныхСредств.БезвозмезднаяУслуга)
	//|			ТОГДА &НормативЗарплаты
	|			ТОГДА ВЫБОР КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.НормативЗарплаты, 0) = 0 ТОГДА &НормативЗарплаты ИНАЧЕ ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.НормативЗарплаты, 0) КОНЕЦ
	|		КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) = 0
	|			ТОГДА 0
	//|		ИНАЧЕ &НормативЗарплаты
	|		ИНАЧЕ ВЫБОР КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.НормативЗарплаты, 0) = 0 ТОГДА &НормативЗарплаты ИНАЧЕ ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.НормативЗарплаты, 0) КОНЕЦ
	|	КОНЕЦ КАК НормативЗарплаты,
	|	СУММА(ВыполнениеЗаданияРаботникиОрганизации.Сумма) КАК Выручка,	
	|	СУММА(ВЫБОР
	|		КОГДА ВыполнениеЗаданияРаботникиОрганизации.ВариантПриемаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемаДенежныхСредств.Наличные)
	|			ТОГДА ВыполнениеЗаданияРаботникиОрганизации.Сумма 
	|		ИНАЧЕ 0
	|		КОНЕЦ) КАК Наличные,
	|	ВЫБОР
	|		КОГДА ВыполнениеЗаданияРаботникиОрганизации.ВариантПриемаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемаДенежныхСредств.БезвозмезднаяУслуга)
	|			ТОГДА ""Работы, выполненные на безвозмездной основе (при наличии цены по прейскуранту)""
	|		КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) = 0
	|			ТОГДА ""Работы, выполненные на безвозмездной основе (при наличии сдельной расценки)""
	|		ИНАЧЕ ""Работы, выполненные на платной основе""
	|	КОНЕЦ КАК ВыполненныеРаботы,
	|	ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Организация КАК Организация,
	|	СУММА(ВЫРАЗИТЬ(ВыполнениеЗаданияРаботникиОрганизации.ПродолжительностьРаботы КАК ЧИСЛО(16, 3))) КАК Трудоемкость,
	|	ЕСТЬNULL(ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка,0) КАК Ставка,
	|	ДанныеСотрудника.Подразделение КАК Подразделение,
	|	ДанныеСотрудника.Должность КАК Должность,
	|	ДанныеСотрудника.Разряд КАК Разряд,
	|	ЕСТЬNULL(РабочееВремяРаботниковОрганизацийПоМастерам.Часов,0) КАК ЧасовПоМастерам,
	|	ЕСТЬNULL(РабочееВремяРаботниковОрганизаций.Часов,0) КАК Часов
	|ИЗ
	|	Документ.ВыполнениеЗадания.РаботникиОрганизации КАК ВыполнениеЗаданияРаботникиОрганизации
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
	|	ПО Сотрудники.Сотрудник = ВыполнениеЗаданияРаботникиОрганизации.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОВидахРабот.СрезПоследних(&КонецПериода, ) КАК СведенияОВидахРаботСрезПоследних
	|		ПО ВыполнениеЗаданияРаботникиОрганизации.ВидРаботы = СведенияОВидахРаботСрезПоследних.ВидРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
	|		ПО ВыполнениеЗаданияРаботникиОрганизации.Сотрудник = РабочееВремяРаботниковОрганизаций.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРабочееВремяРаботниковОрганизацийПоМастерам КАК РабочееВремяРаботниковОрганизацийПоМастерам
	|		ПО ВыполнениеЗаданияРаботникиОрганизации.Сотрудник = РабочееВремяРаботниковОрганизацийПоМастерам.Сотрудник
	|		И ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Мастер = РабочееВремяРаботниковОрганизацийПоМастерам.Мастер
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеСотрудника КАК ДанныеСотрудника
	|		ПО ВыполнениеЗаданияРаботникиОрганизации.Сотрудник = ДанныеСотрудника.Сотрудник
	|			И ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Организация = ДанныеСотрудника.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОклады КАК ТарифныеСтавкиРаботниковОрганизацииСрезПоследних
	|		ПО ВыполнениеЗаданияРаботникиОрганизации.Сотрудник = ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Сотрудник
	|			И ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Организация = ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Организация
	|ГДЕ
	|	ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Организация=&Организация
	|	И ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыполнениеЗаданияРаботникиОрганизации.Сотрудник,
	|	ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Мастер,
	|	ВыполнениеЗаданияРаботникиОрганизации.Ссылка.Организация,
	|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка,
	|	ДанныеСотрудника.Подразделение,
	|	ДанныеСотрудника.Должность,
	|	ДанныеСотрудника.Разряд,
	|	РабочееВремяРаботниковОрганизаций.Часов,
	|	РабочееВремяРаботниковОрганизацийПоМастерам.Часов,
	|	ВЫБОР
	|		КОГДА ВыполнениеЗаданияРаботникиОрганизации.ВариантПриемаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемаДенежныхСредств.БезвозмезднаяУслуга)
	//|			ТОГДА &НормативЗарплаты
	|			ТОГДА ВЫБОР КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.НормативЗарплаты, 0) = 0 ТОГДА &НормативЗарплаты ИНАЧЕ ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.НормативЗарплаты, 0) КОНЕЦ
	|		КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) = 0
	|			ТОГДА 0
	//|		ИНАЧЕ &НормативЗарплаты
	|		ИНАЧЕ ВЫБОР КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.НормативЗарплаты, 0) = 0 ТОГДА &НормативЗарплаты ИНАЧЕ ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.НормативЗарплаты, 0) КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВыполнениеЗаданияРаботникиОрганизации.ВариантПриемаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемаДенежныхСредств.БезвозмезднаяУслуга)
	|			ТОГДА ""Работы, выполненные на безвозмездной основе (при наличии цены по прейскуранту)""
	|		КОГДА ЕСТЬNULL(СведенияОВидахРаботСрезПоследних.СтоимостьПоПрейскуранту, 0) = 0
	|			ТОГДА ""Работы, выполненные на безвозмездной основе (при наличии сдельной расценки)""
	|		ИНАЧЕ ""Работы, выполненные на платной основе""
	|	КОНЕЦ
	|ИТОГИ ПО";
	
	Если НеГруппироватьПоМастерам ТОгда
		Запрос.Текст = Запрос.Текст+
		"	Сотрудник
		|	ВыполненныеРаботы";
	Иначе
		Запрос.Текст = Запрос.Текст+
		"	Мастер,
		|	Сотрудник
		|	ВыполненныеРаботы";
	КонецЕсли;
	

	ЗапросПоОтветственным=Новый Запрос;
	
	ЗапросПоОтветственным.УстановитьПараметр("СписокОтветственных",ОтветственныеЛица.ВыгрузитьКолонку("Сотрудник"));
	ЗапросПоОтветственным.УстановитьПараметр("НачалоПериода",НачалоДня(НачПериода));
	ЗапросПоОтветственным.УстановитьПараметр("Организация",Организация);
	ЗапросПоОтветственным.УстановитьПараметр("КонецПериода",КонецДня(КонПериода));
	
	ЗапросПоОтветственным.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ТарифныеСтавкиРаботниковОрганизации.Период) КАК Период,
	|	ТарифныеСтавкиРаботниковОрганизации.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
	|			ТОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор.Организация
	|		КОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
	|				И ТарифныеСтавкиРаботниковОрганизации.Регистратор.ОбособленноеПодразделениеКуда = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор.Организация
	|		ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Регистратор.ОбособленноеПодразделениеКуда
	|	КОНЕЦ КАК Организация
	|ПОМЕСТИТЬ ВТДатыПоследнихИзмененийОкладов
	|ИЗ
	|	РегистрСведений.ТарифныеСтавкиРаботниковОрганизации КАК ТарифныеСтавкиРаботниковОрганизации
	|ГДЕ
	|	ТарифныеСтавкиРаботниковОрганизации.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|	И ТарифныеСтавкиРаботниковОрганизации.Период <= &КонецПериода
	|	И ТарифныеСтавкиРаботниковОрганизации.Сотрудник В (&СписокОтветственных)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТарифныеСтавкиРаботниковОрганизации.Сотрудник,
	|	ВЫБОР
	|		КОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
	|			ТОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор.Организация
	|		КОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
	|				И ТарифныеСтавкиРаботниковОрганизации.Регистратор.ОбособленноеПодразделениеКуда = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ТарифныеСтавкиРаботниковОрганизации.Регистратор.Организация
	|		ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Регистратор.ОбособленноеПодразделениеКуда
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(РаботникиОрганизаций.Период) КАК Период,
	|	РаботникиОрганизаций.Сотрудник.Физлицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизаций.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РаботникиОрганизаций.ОбособленноеПодразделениеЗавершения
	|		ИНАЧЕ РаботникиОрганизаций.ОбособленноеПодразделение
	|	КОНЕЦ КАК Организация
	|ПОМЕСТИТЬ ВТДатыПоследнихДвижений
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|ГДЕ
	|	РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|	И РаботникиОрганизаций.Период <= &КонецПериода
	|	И РаботникиОрганизаций.Сотрудник  В (&СписокОтветственных)
	|
	|СГРУППИРОВАТЬ ПО
	|	РаботникиОрганизаций.Сотрудник.Физлицо,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизаций.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РаботникиОрганизаций.ОбособленноеПодразделениеЗавершения
	|		ИНАЧЕ РаботникиОрганизаций.ОбособленноеПодразделение
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатыПоследнихДвижений.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ДатыПоследнихДвижений.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ДатыПоследнихДвижений.Организация
	|		ИНАЧЕ ДатыПоследнихДвижений.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизацийСрезПоследних.ТабельныйНомер КАК ТабельныйНомер,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизацииЗавершения
	|		ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацийСрезПоследних.ДолжностьЗавершения
	|		ИНАЧЕ РаботникиОрганизацийСрезПоследних.Должность
	|	КОНЕЦ КАК Должность,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &КонецПериода
	|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацийСрезПоследних.РазрядЕТСЗавершения
	|		ИНАЧЕ РаботникиОрганизацийСрезПоследних.РазрядЕТС
	|	КОНЕЦ КАК Разряд
	|ИЗ
	|	ВТДатыПоследнихДвижений КАК ДатыПоследнихДвижений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийСрезПоследних
	|		ПО ДатыПоследнихДвижений.Период = РаботникиОрганизацийСрезПоследних.Период
	|			И ДатыПоследнихДвижений.ФизЛицо = РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо";
	
	РезультатОтветственные=ЗапросПоОтветственным.Выполнить();
	
	Результат = Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СотрудникиСДатами.Сотрудник КАК Сотрудник,
	|	СотрудникиСДатами.Мастер КАК Мастер,
	|	СотрудникиСДатами.ДатаВыполнения КАК ДатаВыполнения,
	|	СотрудникиСДатами.ПродолжительностьРаботы КАК ПродолжительностьРаботы,
	|	ЕСТЬNULL(РабочееВремяРаботниковОрганизаций.Часов,0) КАК Часов
	|ИЗ
	|	ВТСотрудникиСДатами КАК СотрудникиСДатами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
	|		ПО (РабочееВремяРаботниковОрганизаций.Сотрудник = СотрудникиСДатами.Сотрудник)
	|			И (РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Работа))
	|			И (НАЧАЛОПЕРИОДА(РабочееВремяРаботниковОрганизаций.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(СотрудникиСДатами.ДатаВыполнения, ДЕНЬ))
	|			И (РабочееВремяРаботниковОрганизаций.Период МЕЖДУ &НачалоПериода И &КонецПериода)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	ДатаВыполнения";
	
	ТаблицаВремени = Запрос.Выполнить().Выгрузить();
	ТаблицаВремени.Колонки.Добавить("ОтработаноЧасов");	
	
	ДокументРезультат.Очистить();
	Макет = ПолучитьМакет("СравнительныйАнализ");
	
	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	ОбластьМастер=Макет.ПолучитьОбласть("Мастер");
	ОбластьСтрока=Макет.ПолучитьОбласть("Строка");
	ОбластьИтого=Макет.ПолучитьОбласть("Подвал");
	ОбластьРуки=Макет.ПолучитьОбласть("Руки");
	
	ОбластьШапка.Параметры.Организация=Организация;
	ОбластьШапка.Параметры.ПериодОтчета=ФОРМАТ(КонПериода,"ДФ='ММММ гггг ""г.""'");
	ОбластьШапка.Параметры.ПериодОтчета=ПредставлениеПериода(НачПериода,КонецДня(КонПериода));
	
	Если ТипСотрудника = 0 ТОгда
		ОбластьШапка.Параметры.ТипСотрудников = "Сдельщики";	
	ИначеЕсли ТипСотрудника = 1 Тогда
		ОбластьШапка.Параметры.ТипСотрудников = "Повременщики";
	Иначе
		ОбластьШапка.Параметры.ТипСотрудников = "Сдельщики и повременщики";	
	КонецЕсли;
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	ВыборкаПоМастерам=Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	ИтогоЧасов=0;
	ИтогоСдельная=0;
	ИтогоПовременная=0;
	ИтогоВыручка=0;
	ИтогоНаличные=0;
	ИтогоТрудоемкость=0;
	
	Если НеГруппироватьПоМастерам ТОгда
			
			Нпп=1;
			ВыборкаПоСотрудникам = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
			
			Пока ВыборкаПоСотрудникам.Следующий() Цикл
				ВыборкаПоРаботам=ВыборкаПоСотрудникам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Трудоемкость=ВыборкаПоСотрудникам.Трудоемкость;	
				Выручка=ВыборкаПоСотрудникам.Выручка;
				Наличные=ВыборкаПоСотрудникам.Наличные;
				Сдельная=0;
				Пока ВыборкаПоРаботам.Следующий() Цикл
					ОбластьСтрока.Параметры.Заполнить(ВыборкаПоРаботам);
					Ставка=ВыборкаПоРаботам.Ставка;
					Часов=ВыборкаПоРаботам.Часов;				
					Если ВыборкаПоРаботам.НормативЗарплаты<>0 ТОгда 
						СуммаПоНаряду=Окр(ВыборкаПоРаботам.ОбъемРабот*ВыборкаПоРаботам.НормативЗарплаты,2);
					Иначе
						СуммаПоНаряду=ВыборкаПоРаботам.СуммаПоНаряду;
					КонецЕсли;
					Сдельная=Сдельная+СуммаПоНаряду;
				КонецЦикла;				
				ОбластьСтрока.Параметры.Сдельная=Сдельная;
				ОбластьСтрока.Параметры.Трудоемкость=Трудоемкость;
				ОбластьСтрока.Параметры.Повременная=Ставка*Часов;
				ОбластьСтрока.Параметры.Выручка=Выручка;
				ОбластьСтрока.Параметры.Наличные=Наличные;
				ОбластьСтрока.Параметры.Нпп=Нпп;
				
				ДокументРезультат.Вывести(ОбластьСтрока);
				
				ИтогоЧасов=ИтогоЧасов+Часов;
				ИтогоСдельная=ИтогоСдельная+Сдельная;
				ИтогоПовременная=ИтогоПовременная+Ставка*Часов;
				ИтогоВыручка=ИтогоВыручка+Выручка;
				ИтогоНаличные=ИтогоНаличные+Наличные;
				ИтогоТрудоемкость=ИтогоТрудоемкость+Трудоемкость;
				
				Нпп=Нпп+1;
				
			КонецЦикла;		
	Иначе
		Пока ВыборкаПоМастерам.Следующий() Цикл
			
			Нпп=1;
			ОбластьМастер.Параметры.Заполнить(ВыборкаПоМастерам);
			ДокументРезультат.Вывести(ОбластьМастер);
			ВыборкаПоСотрудникам = ВыборкаПоМастерам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
			
			Пока ВыборкаПоСотрудникам.Следующий() Цикл
				ВыборкаПоРаботам=ВыборкаПоСотрудникам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Трудоемкость=ВыборкаПоСотрудникам.Трудоемкость;	
				Выручка=ВыборкаПоСотрудникам.Выручка;
				Наличные=ВыборкаПоСотрудникам.Наличные;
				Сдельная=0;
				Пока ВыборкаПоРаботам.Следующий() Цикл
					ОбластьСтрока.Параметры.Заполнить(ВыборкаПоРаботам);
					Часов=ВыборкаПоРаботам.ЧасовПоМастерам;
					ОбластьСтрока.Параметры.Часов = УточнитьЧасыПоМастерам(ТаблицаВремени,ВыборкаПоРаботам.Сотрудник,ВыборкаПоРаботам.Мастер,ВыборкаПоРаботам.ЧасовПоМастерам);
					Ставка=ВыборкаПоРаботам.Ставка;
					//Часов=ВыборкаПоРаботам.Часов;													
					Если ВыборкаПоРаботам.НормативЗарплаты<>0 ТОгда 
						СуммаПоНаряду=Окр(ВыборкаПоРаботам.ОбъемРабот*ВыборкаПоРаботам.НормативЗарплаты,2);
					Иначе
						СуммаПоНаряду=ВыборкаПоРаботам.СуммаПоНаряду;
					КонецЕсли;
					Сдельная=Сдельная+СуммаПоНаряду;
				КонецЦикла;				
				ОбластьСтрока.Параметры.Сдельная=Сдельная;
				ОбластьСтрока.Параметры.Трудоемкость=Трудоемкость;
				ОбластьСтрока.Параметры.Повременная=Ставка*Часов;
				ОбластьСтрока.Параметры.Выручка=Выручка;
				ОбластьСтрока.Параметры.Наличные=Наличные;
				ОбластьСтрока.Параметры.Нпп=Нпп;
				
				ДокументРезультат.Вывести(ОбластьСтрока);
				
				ИтогоЧасов=ИтогоЧасов+Часов;
				ИтогоСдельная=ИтогоСдельная+Сдельная;
				ИтогоПовременная=ИтогоПовременная+Ставка*Часов;
				ИтогоВыручка=ИтогоВыручка+Выручка;
				ИтогоНаличные=ИтогоНаличные+Наличные;
				ИтогоТрудоемкость=ИтогоТрудоемкость+Трудоемкость;
				
				Нпп=Нпп+1;
				
			КонецЦикла;		
			
		КонецЦикла;	
	КонецЕсли;
	ОбластьИтого.Параметры.Часов=ИтогоЧасов;
	ОбластьИтого.Параметры.Повременная=ИтогоПовременная;
	ОбластьИтого.Параметры.Сдельная=ИтогоСдельная;
	ОбластьИтого.Параметры.Выручка=ИтогоВыручка;
	ОбластьИтого.Параметры.Наличные=ИтогоНаличные;
	ОбластьИтого.Параметры.Трудоемкость=ИтогоТрудоемкость;
	
	ДокументРезультат.Вывести(ОбластьИтого);
	
КонецПроцедуры

Процедура РасшифроватьОтчет(Расшифровка) Экспорт
			
КонецПроцедуры


#КонецЕсли
